---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ReferenceBaseOnHost
source: html/8fe0b13d-a96a-9516-52b0-34e4034da8e8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ReferenceBaseOnHost Property

"Reference Base on Host"

## Syntax (C#)
```csharp
public static ForgeTypeId ReferenceBaseOnHost { get; }
```